In [11]:
#1.load the dataset and display its shape, columns, and data types
import pandas as pd

df=pd.read_csv(r"C:\Tekworks\Day 5\messy_employee_dataset_1000_rows.csv")

In [12]:
df.shape

(1000, 9)

In [13]:
df.columns

Index(['user_id', 'age', 'salary', 'department', 'join_date', 'city',
       'performance_score', 'experience_years', 'is_active'],
      dtype='object')

In [14]:
df.dtypes

user_id              object
age                  object
salary               object
department           object
join_date            object
city                 object
performance_score    object
experience_years     object
is_active            object
dtype: object

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   user_id            490 non-null    object
 1   age                886 non-null    object
 2   salary             689 non-null    object
 3   department         859 non-null    object
 4   join_date          781 non-null    object
 5   city               851 non-null    object
 6   performance_score  899 non-null    object
 7   experience_years   873 non-null    object
 8   is_active          800 non-null    object
dtypes: object(9)
memory usage: 70.4+ KB

In [ ]:

#2.calculate the percentage of missing values for each column

In [16]:
missing_percent = (df.isnull().sum() / len(df)) * 100
missing_percent

user_id              51.0
age                  11.4
salary               31.1
department           14.1
join_date            21.9
city                 14.9
performance_score    10.1
experience_years     12.7
is_active            20.0
dtype: float64

In [17]:
missing_percent.round(2)

user_id              51.0
age                  11.4
salary               31.1
department           14.1
join_date            21.9
city                 14.9
performance_score    10.1
experience_years     12.7
is_active            20.0
dtype: float64

In [18]:
missing_df = pd.DataFrame({
    "Missing Values (%)": (df.isnull().sum() / len(df)) * 100
})

missing_df.round(2)

                   Missing Values (%)
user_id                          51.0
age                              11.4
salary                           31.1
department                       14.1
join_date                        21.9
city                             14.9
performance_score                10.1
experience_years                 12.7
is_active                        20.0

In [26]:

#3.identify columns containing mixed data types
mixed_type_cols = [
    col for col in df.columns
    if df[col].apply(type).nunique() > 1
]

mixed_type_cols

['user_id',
 'age',
 'salary',
 'department',
 'join_date',
 'city',
 'performance_score',
 'experience_years',
 'is_active']

In [21]:
for col in mixed_type_cols:
    print(f"\nColumn: {col}")
    print(df[col].apply(type).value_counts())

Column: user_id
user_id
<class 'float'>    510
<class 'str'>      490
Name: count, dtype: int64

Column: age
age
<class 'str'>      886
<class 'float'>    114
Name: count, dtype: int64

Column: salary
salary
<class 'str'>      689
<class 'float'>    311
Name: count, dtype: int64

Column: department
department
<class 'str'>      859
<class 'float'>    141
Name: count, dtype: int64

Column: join_date
join_date
<class 'str'>      781
<class 'float'>    219
Name: count, dtype: int64

Column: city
city
<class 'str'>      851
<class 'float'>    149
Name: count, dtype: int64

Column: performance_score
performance_score
<class 'str'>      899
<class 'float'>    101
Name: count, dtype: int64

Column: experience_years
experience_years
<class 'str'>      873
<class 'float'>    127
Name: count, dtype: int64

Column: is_active
is_active
<class 'str'>      800
<class 'float'>    200
Name: count, dtype: int64

In [27]:

#4.clean user_id by replacing empty strings with NaN and converting values to uppercase
import numpy as np

df['user_id'] = (
    df['user_id']
    .replace('', np.nan)
    .str.upper()
)

In [28]:
df['user_id'].head()

0    USER_0
1     U1001
2     U1002
3       NaN
4       NaN
Name: user_id, dtype: object

In [29]:
df['user_id'].isnull().sum()

np.int64(510)

In [30]:

#5.convert age to numeric and replace invalid values(negative or >100) with NaN
import numpy as np
# convert to numeric (invalid parsing → NaN)
df['age'] = pd.to_numeric(df['age'], errors='coerce')
# replace negative ages or ages > 100 with NaN
df.loc[(df['age'] < 0) | (df['age'] > 100), 'age'] = np.nan

In [31]:
df['age'].describe()

count    534.000000
mean      35.983146
std       15.746517
min       18.000000
25%       25.000000
50%       30.000000
75%       45.000000
max       60.000000
Name: age, dtype: float64

In [32]:
df['age'].isnull().sum()

np.int64(466)

In [33]:

#6.clean salary by removing currency symbols and converting it to numeric
import numpy as np
df['salary'] = (
    df['salary']
    .replace(r'[^\d.]', '', regex=True)  # remove currency symbols & commas
)
df['salary'] = pd.to_numeric(df['salary'], errors='coerce')

In [34]:
df['salary'].head()

0     50000.00
1     45000.00
2     25000.00
3          NaN
4    120000.75
Name: salary, dtype: float64

In [35]:
df['salary'].dtypes

dtype('float64')

In [36]:

#7.convert join_date into datetime format handling multiple date formats
df['join_date'] = pd.to_datetime(
    df['join_date'],
    errors='coerce',
    infer_datetime_format=True,
    dayfirst=True
)

C:\Users\MAHIPALREDDY\AppData\Local\Temp\ipykernel_28880\3842072275.py:2: UserWarning: The argument 'infer_datetime_format' is deprecated and will be removed in a future version. A strict version of it is now the default, see https://pandas.pydata.org/pdeps/0004-consistent-to-datetime-parsing.html. You can safely remove this argument.
  df['join_date'] = pd.to_datetime(

In [37]:
df['join_date'].head()

0   2020-01-12
1          NaT
2          NaT
3          NaT
4          NaT
Name: join_date, dtype: datetime64[ns]

In [38]:
df['join_date'].dtypes

dtype('<M8[ns]')

In [39]:
df['join_date'].isnull().sum()

np.int64(790)

In [40]:

#8.extract joining year from the cleaned join_date
df['joining_year'] = df['join_date'].dt.year

In [41]:
df[['join_date', 'joining_year']].head()

   join_date  joining_year
0 2020-01-12        2020.0
1        NaT           NaN
2        NaT           NaN
3        NaT           NaN
4        NaT           NaN

In [42]:

#9.standardize department values by trimming spaces and converting to uppercase
df['department'] = (
    df['department']
    .astype(str)
    .str.strip()
    .str.upper()
)

In [43]:
df['department'].unique()

array(['HR', 'FINANCE', 'IT', 'NAN', 'SALES'], dtype=object)

In [44]:

#10.Normalize city names to a consistent case and spelling
df['city'] = (
    df['city']
    .astype(str)
    .str.strip()
    .str.title()
)

In [45]:
city_map = {
    'Bangalore': 'Bengaluru',
    'Bangaluru': 'Bengaluru',
    'Hyd': 'Hyderabad',
    'Secunderabad': 'Hyderabad',
    'Bombay': 'Mumbai',
    'Madras': 'Chennai'
}

df['city'] = df['city'].replace(city_map)

In [46]:
df['city'].unique()

array(['Delhi', 'Hyderabad', 'Nan', 'Mumbai', 'Bengaluru'], dtype=object)

In [47]:
#11.convert performance score into numeric by mapping text values to numbers
performance_map = {
    'POOR': 1,
    'AVERAGE': 2,
    'GOOD': 3,
    'VERY GOOD': 4,
    'EXCELLENT': 5
}

df['performance_score'] = (
    df['performance_score']
    .astype(str)
    .str.strip()
    .str.upper()
    .map(performance_map)
)

In [48]:
df[['performance_score']].head()

   performance_score
0                NaN
1                NaN
2                5.0
3                5.0
4                NaN

In [49]:
df['performance_score'].unique()

array([nan,  5.,  1.])

In [50]:
#12.clean experience years by converting text values to numeric and removing negatives
import numpy as np
# Convert text to numeric (invalid → NaN)
df['experience_years'] = pd.to_numeric(
    df['experience_years'],
    errors='coerce'
)
# Remove negative experience values
df.loc[df['experience_years'] < 0, 'experience_years'] = np.nan

In [51]:
df['experience_years'].describe()

count    615.000000
mean       3.783740
std        3.472141
min        0.000000
25%        1.000000
50%        3.000000
75%        5.000000
max       10.000000
Name: experience_years, dtype: float64

In [52]:
df['experience_years'].isnull().sum()

np.int64(385)

In [53]:
#13.convert is_active values (yes/no/True/False) into boolean format
import numpy as np
bool_map = {
    'YES': True,
    'NO': False,
    'TRUE': True,
    'FALSE': False,
    'Y': True,
    'N': False,
    '1': True,
    '0': False
}
df['is_active'] = (
    df['is_active']
    .astype(str)
    .str.strip()
    .str.upper()
    .map(bool_map)
)

In [54]:
df['is_active'].value_counts(dropna=False)

is_active
False    429
True     371
NaN      200
Name: count, dtype: int64

In [55]:
df['is_active'].dtypes

dtype('O')

In [56]:
#14.Identify and remove duplicate records based on user_id
df[df.duplicated(subset='user_id', keep=False)]

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active,joining_year
3,NaN,NaN,NaN,HR,NaT,Hyderabad,5.0,5.0,True,NaN
4,NaN,NaN,120000.75,IT,NaT,Delhi,NaN,NaN,False,NaN
6,NaN,45.0,25000.00,NAN,NaT,Mumbai,NaN,NaN,NaN,NaN
7,NaN,45.0,45000.00,NAN,NaT,Delhi,NaN,NaN,True,NaN
12,NaN,60.0,45000.00,IT,NaT,Nan,NaN,5.0,False,NaN
...,...,...,...,...,...,...,...,...,...,...
992,NaN,18.0,NaN,IT,2020-01-12,Mumbai,5.0,3.0,NaN,2020.0
993,NaN,NaN,NaN,SALES,NaT,Nan,NaN,5.0,NaN,NaN
994,NaN,NaN,120000.75,IT,NaT,Mumbai,1.0,NaN,True,NaN
995,NaN,60.0,50000.00,HR,NaT,Delhi,NaN,NaN,NaN,NaN
999,NaN,30.0,45000.00,HR,NaT,Hyderabad,5.0,NaN,False,NaN

In [57]:
df.duplicated(subset='user_id').sum()

np.int64(509)

In [58]:
df = df.drop_duplicates(subset='user_id', keep='first')

In [59]:
df['user_id'].duplicated().sum()

np.int64(0)

In [60]:
df['user_id'].shape

(491,)

In [61]:
#15.create a clean final DataFrame containing only valid, standardized records
clean_df = df[
    df['user_id'].notna() &
    df['age'].notna() &
    df['salary'].notna() &
    df['join_date'].notna() &
    df['department'].notna() &
    df['city'].notna() &
    df['performance_score'].notna() &
    df['experience_years'].notna() &
    df['is_active'].notna()
].copy()

In [62]:
clean_df = clean_df[
    [
        'user_id',
        'age',
        'salary',
        'join_date',
        'joining_year',
        'department',
        'city',
        'performance_score',
        'experience_years',
        'is_active'
    ]
]

In [63]:
clean_df.shape

(4, 10)

In [64]:
clean_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 29 to 867
Data columns (total 10 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   user_id            4 non-null      object
 1   age                4 non-null      float64
 2   salary             4 non-null      float64
 3   join_date          4 non-null      datetime64[ns]
 4   joining_year       4 non-null      float64
 5   department         4 non-null      object
 6   city               4 non-null      object
 7   performance_score  4 non-null      float64
 8   experience_years   4 non-null      float64
 9   is_active          4 non-null      object
dtypes: datetime64[ns](1), float64(5), object(4)
memory usage: 352.0+ bytes

In [65]:
clean_df.head()

,user_id,age,salary,join_date,joining_year,department,city,performance_score,experience_years,is_active
29,USER_29,25.0,25000.00,2020-01-12,2020.0,HR,Delhi,1.0,3.0,True
406,U1406,30.0,120000.75,2020-01-12,2020.0,HR,Hyderabad,5.0,10.0,False
646,USER_646,18.0,78000.00,2020-01-12,2020.0,IT,Hyderabad,1.0,0.0,False
867,U1867,60.0,78000.00,2020-01-12,2020.0,IT,Delhi,1.0,3.0,True